# Pandas IO 도구들

In [2]:
import pandas as pd
import numpy as np

## CSV 파일 입출력
csv 가져오기

In [3]:
csv_df = pd.read_csv('test.csv')
csv_df

  col1 col2  col3
0    a    b     1
1    a    b     2
2    c    d     3

In [4]:
csv_df.to_csv('output.csv')

## 엑셀 파일 입출력
데이터 프레임을 excel 데이터로 저장하기

In [6]:
!pip install xlwt # xls로 입출력할 떄 필요한 라이브러리 설치

Collecting xlwt
  Using cached xlwt-1.3.0-py2.py3-none-any.whl (99 kB)
Installing collected packages: xlwt
Successfully installed xlwt-1.3.0

In [7]:
# a.xls: 파일시스템, 바이너리로 구성된 시스템
# a.xlsx: xml 파일이 zip으로 압축된 형식을 지님
csv_df.to_excel('a.xlsx')
csv_df.to_excel('a.xls')

C:\Users\isc03\AppData\Local\Temp\ipykernel_20924\124954584.py:4: FutureWarning: As the xlwt package is no longer maintained, the xlwt engine will be removed in a future version of pandas. This is the only engine in pandas that supports writing in the xls format. Install openpyxl and write to an xlsx file instead. You can set the option io.excel.xls.writer to 'xlwt' to silence this warning. While this option is deprecated and will also raise a warning, it can be globally set and the warning suppressed.
  csv_df.to_excel('a.xls')

In [12]:
xlsx_df = pd.read_excel('a.xlsx', sheet_name='Sheet1')
xlsx_df

   Unnamed: 0 col1 col2  col3
0           0    a    b     1
1           1    a    b     2
2           2    c    d     3

In [10]:
xls_df = pd.read_excel('a.xls')
xls_df

   Unnamed: 0 col1 col2  col3
0           0    a    b     1
1           1    a    b     2
2           2    c    d     3

## HTML 파일에서 데이터 입출력

In [18]:
naver_finance_url = "https://finance.naver.com/"
html_dfs = pd.read_html(naver_finance_url, encoding='euc-kr')
print("TOP 종목")
html_dfs[0]

TOP 종목

                  종목명    현재가      전일대비      등락률
0              베트남개발1    297    하락 124  -29.45%
1    KODEX 200선물인버스2X   3675     상승 70   +1.94%
2               에이프로젠    992     상승 69   +7.48%
3              씨케이에이치    254     하락 24   -8.63%
4   KODEX 코스닥150선물인버스   5670    상승 125   +2.25%
5          KODEX 레버리지  12335    하락 260   -2.06%
6    KODEX 코스닥150레버리지   6210    하락 285   -4.39%
7           KODEX 인버스   5315     상승 45   +0.85%
8               이엔플러스   4920  상승 1,050  +27.13%
9               조광ILI   1385    상승 110   +8.63%
10          이스트아시아홀딩스    213      하락 2   -0.93%
11               한신기계   7510  상승 1,460  +24.13%
12              스킨앤스킨    269     상승 62  +29.95%
13               EDGC   2305    상승 115   +5.25%
14             글로벌에스엠    870     상승 37   +4.44%

In [20]:
# table의 개수 
len(html_dfs)

12

In [21]:
html_dfs[0].to_html('naver_finance.html')

## mysql 데이터베이스

GCP에 mysql 서비스를 오픈해두겠다. 파이썬 라이브러리를 사용해 34.123.229.9:3306포트로 접속하면 된다.
```bash
sudo -i
apt update
apt install docker.io -y
docker run --name some-mysql -e MYSQL_ROOT_PASSWORD=test1234 -d mysql:5.7 -p 3306:3306
```

In [23]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.0.2-py3-none-any.whl (43 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.0.2

In [26]:
import pymysql

# pymysql 라이브러리는 파이썬으로 mysql 데이터베이스 접근하는 기능을 가지고 있다.
# db -> 엑셀 파일
# table -> 시트

conn = pymysql.connect(
    host='34.123.229.9', # db 서버의 아이피 
    user='root',         # 유저 이름
    password='test1234', # 패스워드
    db='mysql',          # 접근하려는 데이터베이스
    charset='utf8'
)
sql = 'select * from user' # user 테이블을 조회하는 구문

sql_df = pd.read_sql_query(sql, conn)
sql_df

C:\Users\isc03\anaconda3\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

,Host,User,Select_priv,Insert_priv,Update_priv,Delete_priv,Create_priv,Drop_priv,Reload_priv,Shutdown_priv,...,max_questions,max_updates,max_connections,max_user_connections,plugin,authentication_string,password_expired,password_last_changed,password_lifetime,account_locked
0,localhost,root,Y,Y,Y,Y,Y,Y,Y,Y,...,0,0,0,0,mysql_native_password,*3D3B92F242033365AE5BC6A8E6FC3E1679F4140A,N,2022-10-20 11:31:41,None,N
1,localhost,mysql.session,N,N,N,N,N,N,N,N,...,0,0,0,0,mysql_native_password,*THISISNOTAVALIDPASSWORDTHATCANBEUSEDHERE,N,2022-10-20 11:31:36,None,Y
2,localhost,mysql.sys,N,N,N,N,N,N,N,N,...,0,0,0,0,mysql_native_password,*THISISNOTAVALIDPASSWORDTHATCANBEUSEDHERE,N,2022-10-20 11:31:36,None,Y
3,%,root,Y,Y,Y,Y,Y,Y,Y,Y,...,0,0,0,0,mysql_native_password,*3D3B92F242033365AE5BC6A8E6FC3E1679F4140A,N,2022-10-20 11:31:41,None,N

# 데이터 정렬하기

In [27]:
se = pd.Series(range(10), index=[10,9,8,7,6,5,4,3,2,1])
se.index.name = 'index'
se

index
10    0
9     1
8     2
7     3
6     4
5     5
4     6
3     7
2     8
1     9
dtype: int64

In [31]:
se = se.sort_index() # 오름차순(ascending의 기본값은 True)
se

index
1     9
2     8
3     7
4     6
5     5
6     4
7     3
8     2
9     1
10    0
dtype: int64

In [32]:
se.sort_index(ascending=False) # 내림차순

index
10    0
9     1
8     2
7     3
6     4
5     5
4     6
3     7
2     8
1     9
dtype: int64

In [33]:
data_table = {
    'id': [1,2,3],
    'name': ['Choi', 'Lee', 'Kim'],
    'age': [10,20,30],
    'asets': [150.4, 123.4, 88.88],
    'job': ['student', 'CEO', 'Dad']
}

df = pd.DataFrame(data_table)
df

   id  name  age   asets      job
0   1  Choi   10  150.40  student
1   2   Lee   20  123.40      CEO
2   3   Kim   30   88.88      Dad

In [35]:
df.sort_index(ascending=False)

   id  name  age   asets      job
2   3   Kim   30   88.88      Dad
1   2   Lee   20  123.40      CEO
0   1  Choi   10  150.40  student

In [37]:
df.sort_values('asets')

   id  name  age   asets      job
2   3   Kim   30   88.88      Dad
1   2   Lee   20  123.40      CEO
0   1  Choi   10  150.40  student

In [39]:
df.sort_values(['asets', 'name']) # 1순위 assets, 2순위 name

   id  name  age   asets      job
2   3   Kim   30   88.88      Dad
1   2   Lee   20  123.40      CEO
0   1  Choi   10  150.40  student

In [40]:
df.sort_index(axis=1)

   age   asets  id      job  name
0   10  150.40   1  student  Choi
1   20  123.40   2      CEO   Lee
2   30   88.88   3      Dad   Kim

## 데이터 정렬 - 연습문제
1. 구구단 9단의 시리즈 se2를 생성하되, 인덱스를 거꾸로 생성하라.
2. 구구단을 거꾸로 출력하라.
3. 구구단 7단과 8단을 만들어 df2에 추가하라.
4. df2의 컬럼을 오름차순으로 정렬하라.

In [48]:
# 1
goodan_se = pd.Series(np.arange(1,10) * 9)
goodan_se.index = goodan_se.index[::-1]
goodan_se

8     9
7    18
6    27
5    36
4    45
3    54
2    63
1    72
0    81
dtype: int32

In [50]:
# 2
goodan_se.sort_values(ascending=False)

0    81
1    72
2    63
3    54
4    45
5    36
6    27
7    18
8     9
dtype: int32

In [54]:
df2 = pd.DataFrame([np.arange(1,10) * 7, np.arange(1,10) * 8], 
                   index=['7단', '8단'])
df2 = df2.T
df2

   7단  8단
0   7   8
1  14  16
2  21  24
3  28  32
4  35  40
5  42  48
6  49  56
7  56  64
8  63  72

In [55]:
df2.sort_index(axis=1, ascending=True)

   7단  8단
0   7   8
1  14  16
2  21  24
3  28  32
4  35  40
5  42  48
6  49  56
7  56  64
8  63  72